In [14]:
import pandas as pd 
import glob 
import os

In [24]:
glob.glob('../aux_data/*edu*')

['../aux_data/edu_ind.csv',
 '../aux_data/edu_hh.dta',
 '../aux_data/edu_ind.dta',
 '../aux_data/edu_hh.csv']

In [25]:
hh_edu = pd.read_csv('../aux_data/edu_hh.csv')

In [33]:
ind_edu = pd.read_csv('../aux_data/edu_ind.csv', dtype = {'m_ids': "object"})

In [41]:
trx = pd.read_csv('../diaries_transactions_all.csv', low_memory = False)

In [44]:
keep_ids_list = list(trx.m_ids_owner.unique())

In [34]:
hh_edu.head()

,hh_ids,edu_hh_child613inschool,edu_hh_child1417inschool,edu_hh_girls613inschool,edu_hh_girls1417inschool,edu_hh_boys613inschool,edu_hh_boys1417inschool,edu_hh_headattain_yrs
0,KELDK01,1.0,NaN,1.0,NaN,NaN,NaN,8.0
1,KELDK02,NaN,1.0,NaN,1.0,NaN,NaN,8.0
2,KELDK08,0.0,NaN,NaN,NaN,0.0,NaN,5.0
3,KELDK09,1.0,NaN,1.0,NaN,NaN,NaN,10.0
4,KELDK10,NaN,NaN,NaN,NaN,NaN,NaN,10.0

In [35]:
hh_edu.columns

Index(['hh_ids', 'edu_hh_child613inschool', 'edu_hh_child1417inschool',
       'edu_hh_girls613inschool', 'edu_hh_girls1417inschool',
       'edu_hh_boys613inschool', 'edu_hh_boys1417inschool',
       'edu_hh_headattain_yrs'],
      dtype='object')

In [36]:
hh_edu.shape

(298, 8)

In [37]:
ind_edu.columns

Index(['m_ids', 'hh_ids', 'edu_i_enrolled', 'edu_i_attain',
       'edu_i_attain_yrs'],
      dtype='object')

In [38]:
ind_edu.shape

(1565, 5)

In [39]:
len(ind_edu.m_ids.unique())

1565

In [46]:
ind_edu_sub = ind_edu.loc[ind_edu['m_ids'].isin(keep_ids_list)]

In [47]:
ind_edu_sub.shape

(669, 5)

In [48]:
edu_hh_ind_merge = ind_edu_sub.merge(hh_edu, 'left', ['hh_ids'])

In [50]:
edu_hh_ind_merge.shape

(669, 12)

In [51]:
edu_hh_ind_merge.head()

,m_ids,hh_ids,edu_i_enrolled,edu_i_attain,edu_i_attain_yrs,edu_hh_child613inschool,edu_hh_child1417inschool,edu_hh_girls613inschool,edu_hh_girls1417inschool,edu_hh_boys613inschool,edu_hh_boys1417inschool,edu_hh_headattain_yrs
0,56134390476100000,KELDK01,0.0,Primary (some or complete),8.0,1.0,NaN,1.0,NaN,NaN,NaN,8.0
1,56134390654900000,KELDK01,0.0,Secondary (some or complete),10.0,1.0,NaN,1.0,NaN,NaN,NaN,8.0
2,56134389503000000,KELDK02,0.0,Primary (some or complete),8.0,NaN,1.0,NaN,1.0,NaN,NaN,8.0
3,56134410699600000,KELDK08,0.0,Primary (some or complete),5.0,0.0,NaN,NaN,NaN,0.0,NaN,5.0
4,56134410709700000,KELDK08,0.0,Primary (some or complete),8.0,0.0,NaN,NaN,NaN,0.0,NaN,5.0

In [52]:
edu_hh_ind_merge.columns = ['m_ids', 'hh_ids', 'edu_i_enrolled', 'edu_i_attain', 'edu_i_attain_yrs',
       'edu_hh_child613inschool', 'edu_hh_child1417inschool',
       'edu_hh_girls613inschool', 'edu_hh_girls1417inschool',
       'edu_hh_boys613inschool', 'edu_hh_boys1417inschool',
       'edu_hh_headattain_yrs']

In [53]:
# os.makedirs('data_ind', exist_ok = True)

In [54]:
edu_hh_ind_merge.to_csv('edu_hh_ind_merge.csv')